mrcodetastic/ESP32-HUB75-MatrixPanel-DMA/src/ESP32-HUB75-MatrixPanel-I2S-DMA.cpp
#include "ESP32-HUB75-MatrixPanel-I2S-DMA.h"

#if defined(SPIRAM_DMA_BUFFER)
// Sprite_TM saves the day again...
// https://www.esp32.com/viewtopic.php?f=2&t=30584
#include "rom/cache.h"
#endif

/* This replicates same function in rowBitStruct, but due to induced inlining it might be MUCH faster
 * when used in tight loops while method from struct could be flushed out of instruction cache between
 * loop cycles do NOT forget about buff_id param if using this.
 */
// #define getRowDataPtr(row, _dpth, buff_id) &(dma_buff.rowBits[row]->data[_dpth * dma_buff.rowBits[row]->width + buff_id*(dma_buff.rowBits[row]->width * dma_buff.rowBits[row]->colour_depth)])

// BufferID is now ignored, seperate global pointer pointer!
#define getRowDataPtr(row, _dpth) &(fb->rowBits[row]->data[_dpth * fb->rowBits[row]->width])

/* We need to update the correct uint16_t in the rowBitStruct array, that gets sent out in parallel
 * 16 bit parallel mode - Save the calculated value to the bitplane memory in reverse order to account for I2S Tx FIFO mode1 ordering
 * Irrelevant for ESP32-S2 the way the FIFO ordering works is different - refer to page 679 of S2 technical reference manual
 */
#if defined(ESP32_THE_ORIG)
#define ESP32_TX_FIFO_POSITION_ADJUST(x_coord) (((x_coord)&1U) ? (x_coord - 1) : (x_coord + 1))
#else
#define ESP32_TX_FIFO_POSITION_ADJUST(x_coord) x_coord
#endif






  /* LED Brightness Compensation */                                                               
#ifndef NO_CIE1931                                                                                
  /* CIE 1931 correction with bit-depth-optimized LUTs*/                                            
  #ifdef LUT_NATIVE_BIT_DEPTH


    // Optimized path: LUT maps 8-bit input (0-255) directly to target bit depth output
    #define DO_BRIGHTNESS_COMPENSATION()                                                              \
      auto red_val   = lumConvTab[red];                                                               \
      auto green_val = lumConvTab[green];                                                             \
      auto blue_val  = lumConvTab[blue];                                                              


  #else
    // Fallback for non-standard bit depths: 12-bit LUT with shift+round to target depth

    #define DO_BRIGHTNESS_COMPENSATION()                                                              \
      uint16_t red16   = lumConvTab[red];                                                             \
      uint16_t green16 = lumConvTab[green];                                                           \
      uint16_t blue16  = lumConvTab[blue];                                                            \
                                                                                                      \
      uint8_t shift_amount = 12 - m_cfg.getPixelColorDepthBits();                                     \
      uint16_t rounding = 1 << (shift_amount - 1);                                                    \
      uint16_t max_val = (1 << m_cfg.getPixelColorDepthBits()) -1;                                    \
      auto red_val   = (red16 + rounding) >> shift_amount;                                            \
      auto green_val = (green16 + rounding) >> shift_amount;                                          \
      auto blue_val  = (blue16 + rounding) >> shift_amount;                                           \
                                                                                                      \
      red_val = red_val > max_val ? max_val : red_val;                                                \
      green_val = green_val > max_val ? max_val : green_val;                                          \
      blue_val = blue_val > max_val ? max_val : blue_val;  
  #endif
#else
  // NO_CIE1931: linear scaling with rounding
  #define DO_BRIGHTNESS_COMPENSATION()                                                               \
    uint16_t red16   = red * 256u;                                                                   \
    uint16_t green16 = green * 256u;                                                                 \
    uint16_t blue16  = blue * 256u;                                                                  \
                                                                                                     \
    uint8_t shift_amount = 16 - m_cfg.getPixelColorDepthBits();                                      \
    uint16_t rounding = (1 << (shift_amount - 1))-1;                                                 \
    uint16_t max_val = (1 << m_cfg.getPixelColorDepthBits()) -1;                                     \
    uint16_t red_val   = (red16 + rounding) >> shift_amount;                                         \
    uint16_t green_val = (green16 + rounding) >> shift_amount;                                       \
    uint16_t blue_val  = (blue16 + rounding) >> shift_amount;                                        \
    red_val = red_val > max_val ? max_val : red_val;                                                 \
    green_val = green_val > max_val ? max_val : green_val;                                           \
    blue_val = blue_val > max_val ? max_val : blue_val;                                              
#endif




/* This library is designed to take an 8 bit / 1 byte value (0-255) for each R G B colour sub-pixel.
 *
 * When CIE1931 correction is enabled, input values are passed through a perceptually-linear
 * brightness curve (lumConvTab) that maps to the target bit depth. Native lookup tables are
 * provided for common bit depths (6, 7, 8, 10, 12-bit), while other depths use runtime
 * conversion with rounding to preserve precision and minimize banding artifacts.
 *
 * When NO_CIE1931 is defined, linear scaling is used: 8-bit input is scaled to 16-bit range
 * (input * 257), then shifted down to the target bit depth with rounding.
 */

bool MatrixPanel_I2S_DMA::setupDMA(const HUB75_I2S_CFG &_cfg)
{
  
